<a href="https://colab.research.google.com/github/Sir-Tobias/Java-Repository/blob/master/DT354DataScience3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**This is used to label your code**
hello world example

*   Hello world example
*   Valuable assignment

In [ ]:
mass = 25

volume = 5

density = mass/volume

print(density)

message = 'hello'
person = 'bob'

welcome = message + ' ' + person
print(welcome)

5.0
hello bob

Type Example

In [ ]:
isTodaySunday = False

print(type(isTodaySunday)) # bool

value_str = "25"

print(type(value_str))
print(type(int(value_str))) # forced type int because the value "25" can also be converted to an int

<class 'bool'>
<class 'str'>
<class 'int'>

Help command syntax


*   Put a question mark infront of anything you dont understand
*   ?len


*   ?type
*   ?print

In [ ]:
?len

?type

?print

Python Lists

In [ ]:
a = "is"
b = 2

my_list = ["my_list", a, b]
list_of_lists = [ my_list,[4,5]]
list_of_different_items = [my_list,[4,5],8]
print("list_of_different_items[0] .7", list_of_different_items[0])
print("list_of_different_items[1] .8", list_of_different_items[1])
print("list_of_different_items[2].9", list_of_different_items[2])
print("list_of_different_items[-1].10", list_of_different_items[-1])
print("list_of_different_items len .11", len(list_of_different_items))

list_of_different_items[0] .7 ['my_list', 'is', 2]
list_of_different_items[1] .8 [4, 5]
list_of_different_items[2].9 8
list_of_different_items[-1].10 8
list_of_different_items len .11 3

ASK GOOGLE EXAMPLE

In [ ]:
town = "Dublin and Derry"
print(town.lower())
print(town.lower().count('d'))

dublin and derry
3

Packages & Import

In [ ]:
import math

print(math.sqrt(4))

from math import sin #You can import a specific function from the math libary
print(sin(90))

import math as m# Import as M because you do not have to type math each time
print(m.sin(90))

Logic

In [ ]:
print(True == False)
print(2*8! = -8)

print('Ireland' == 'ireland')
print(False == 0)

Control Flow

In [ ]:
if 9 > 10:
    print("9 is greater than 10")
elif 9 == 10:
    print("9 is equal to 10")
else:
    print("9 is lesser than 10")

9 is lesser than 10

WEEK 3

In [ ]:
x = 1
while x <3: #That has a condition that must be met 
    print(x)
    x += 1
print('>outside break')

while True: #infinite while loop that must be supported through a break
    print(x)
    x += 1
    print (x)
    if x> 6:
      break
print('outside')

1
2
>outside break
3
4
4
5
5
6
6
7
outside

Defining your own functions

In [ ]:
def sum_fr(a,b):
  c = a + b
  return c

print(
     sum_fn(
         1, sum_fn(2)
        )
)

print(
    sum_fn(
        sum_fn(1,2), 3
        )
    )

print(
    sum_fn(
        sum_fn(1,2), sum_fn(2,2)
        )
    )

NameError: ignored

DICTIONARY

In [ ]:
irish_pop_dict = {'Dublin': 1345602, 'Antrim': 617345, 'Cork': 546709}
print(irish_pop_dict['Dublin'])
print(irish_pop_dict.keys())
print(irish_pop_dict.values())
print(irish_pop_dict.items())
print('Dublin' in irish_pop_dict)
print('Down' in irish_pop_dict)
irish_pop_dict['Down'] = 342183
print(irish_pop_dict)

1345602
dict_keys(['Dublin', 'Antrim', 'Cork'])
dict_values([1345602, 617345, 546709])
dict_items([('Dublin', 1345602), ('Antrim', 617345), ('Cork', 546709)])
True
False
{'Dublin': 1345602, 'Antrim': 617345, 'Cork': 546709, 'Down': 342183}

LOOPING OVER THE DICTIONARY

In [ ]:
d = {'one': 1, 'two': 2}

for k, v in d.items():
  print(k,v)

one 1
two 2

Practice Dictionary

In [ ]:
mycountries_dict = {}

mycountries_dict["Ireland"] = ['Dublin', 'Meath']
mycountries_dict["France"] = ['Paris', 'Lyon']
print(mycountries_dict)
#Applying a function
mycountries_dict["Ireland"].append('Cork')
print(mycountries_dict)
for a, c in mycountries_dict.items():
  print(a,c)

ITER METHODS

In [ ]:
for it in 'cat'# creates an iter method in the background

ZIP METHOD

In [ ]:
joined = zip([1,2,3], [4,5,6])#packing or zipping
for x, y in joined:
  print(x,y)

  print(*zip([1,2,3], [4,5,6]))
  l1,l2 = zip(*zip([1,2,3], [4,5,6]))
  print(l1,l2)

1 4
(1, 4) (2, 5) (3, 6)
(1, 2, 3) (4, 5, 6)
2 5
(1, 4) (2, 5) (3, 6)
(1, 2, 3) (4, 5, 6)
3 6
(1, 4) (2, 5) (3, 6)
(1, 2, 3) (4, 5, 6)

List Comprehensions

In [ ]:
def firstn(n):
  num= 0
  while num< n:
    yield num
    num+= 1

WEEK 4

In [ ]:
def download_save_tweet_data():
  if

WEEK 5 WORK

In [9]:
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =[True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

my_dict = {'country': names, 'drives_right': dr, 'cars_per_cap': cpc}
import pandas as pd
cars = pd.DataFrame(my_dict)

row_labels= ['US', 'AUS', 'JAP', 'IN', 'RU', 'MOR', 'EG']
cars.index = row_labels
print(cars)
cars.to_csv('cars.csv')# write as csv

print(cars['country'])
print(type(cars['country']))# Series
print(cars[['country']])
print(type(cars[['country']]))# DataFrame•
print(cars[['country', 'cars_per_cap']]) # can do this, unlike series

display(cars[1:3]) #select rows
#print(cars[1:3]) #select rows
display(cars[1:3][['country', 'drives_right']]) #select rows

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JAP          Japan         False           588
IN           India         False            18
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45
US     United States
AUS        Australia
JAP            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object
<class 'pandas.core.series.Series'>
           country
US   United States
AUS      Australia
JAP          Japan
IN           India
RU          Russia
MOR        Morocco
EG           Egypt
<class 'pandas.core.frame.DataFrame'>
           country  cars_per_cap
US   United States           809
AUS      Australia           731
JAP          Japan           588
IN           India            18
RU          Russia           200
MOR        Morocco            70
EG           Egypt            45

       country  drives_right  cars_per_cap
AUS  Australia         False           731
JAP      Japan         False           588

       country  drives_right
AUS  Australia         False
JAP      Japan         False

Selecting Index

In [11]:
display(cars.loc['US'])  # Series•
display(cars.loc[['US']])  # DataFrame•
display(cars.loc[['US', 'AUS']])  # DataFrame, only selected rows•
display(cars.loc[['US', 'AUS'], ['country', 'cars_per_cap']])  # DataFrame, selected rows & columns•
display(cars.loc[:, ['country', 'cars_per_cap']])  # DataFrame, only selected column

country         United States
drives_right             True
cars_per_cap              809
Name: US, dtype: object

          country  drives_right  cars_per_cap
US  United States          True           809

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731

           country  cars_per_cap
US   United States           809
AUS      Australia           731

           country  cars_per_cap
US   United States           809
AUS      Australia           731
JAP          Japan           588
IN           India            18
RU          Russia           200
MOR        Morocco            70
EG           Egypt            45

Using iloc to select index

In [14]:
display(cars.iloc[0])  # Series•
display(cars.iloc[[0]])  # DataFrame•
display(cars.iloc[[0, 1]])  # DataFrame, only selected rows•
display(cars.iloc[[0, 1], [0, 1]])  # DataFrame, selected rows & columns•
display(cars.iloc[2:6, [0, 1]])  # DataFrame, only selected columns

country         United States
drives_right             True
cars_per_cap              809
Name: US, dtype: object

          country  drives_right  cars_per_cap
US  United States          True           809

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731

           country  drives_right
US   United States          True
AUS      Australia         False

     country  drives_right
JAP    Japan         False
IN     India         False
RU    Russia          True
MOR  Morocco          True

Filtering DataFrame

In [15]:
dr = cars['drives_right']
display(dr)

sel= cars[dr]
display(sel)

display(cars[cars['drives_right']])# one line version

lim= cars['cars_per_cap']>500# select bool series•
sel= cars[lim]# filter cars with condition•
display(sel)

US      True
AUS    False
JAP    False
IN     False
RU      True
MOR     True
EG      True
Name: drives_right, dtype: bool

           country  drives_right  cars_per_cap
US   United States          True           809
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

           country  drives_right  cars_per_cap
US   United States          True           809
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JAP          Japan         False           588

Filtering using between

In [25]:
cpc = cars['cars_per_cap']
import numpy as np
between = np.logical_and(cpc > 100, cpc < 500)
medium = cars[between]
display(medium)

display(cars[cars['cars_per_cap']== 809])

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JAP          Japan         False           588
IN           India         False            18
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

          country  drives_right  cars_per_cap
US  United States          True           809